
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФНФ_Клиент.ОтправитьСообщениеВнешней(Строка(ВыбраннаяСтрока.УникальныйИдентификатор()) + ":");
	
КонецПроцедуры

&НаКлиенте
Процедура ВводКоличества(Количество, ДопПараметры) Экспорт
	
	ПоказатьВводЧисла(
		Новый ОписаниеОповещения(
			"ВводКоличестваЗавершение",
			ЭтотОбъект,
			Новый Структура("Количество", Количество)),
		Количество,
		"Укажите количество товара"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВводКоличестваЗавершение(Число, ДополнительныеПараметры) Экспорт
	
	Количество = ?(Число = Неопределено, ДополнительныеПараметры.Количество, Число);
	Если (Число <> Неопределено) Тогда
		УнИд = Строка(Элементы.Список.ТекущаяСтрока.УникальныйИдентификатор());
		ФНФ_Клиент.ОтправитьСообщениеВнешней(УнИд + ":" + Формат(Количество, "ЧГ="));
	КонецЕсли;
	
КонецПроцедуры
