
Функция ТекстHTML() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	АдресПубликации = Константы.ФНФ_АдресПубликацииБазы.Получить();
	Если ПустаяСтрока(АдресПубликации) Тогда
		ВызватьИсключение "Не заполнен адрес публикации базы!";
	КонецЕсли;
	
	Позиц = СтрНайти(АдресПубликации, "/", НаправлениеПоиска.СКонца);
	АдресСервера = Лев(АдресПубликации, Позиц - 1);
	
	Текст = ПолучитьОбщийМакет("ФНФ_ТекстHTML").ПолучитьТекст();
	Текст = СтрЗаменить(Текст, "АдресПубликации", АдресПубликации);
	Текст = СтрЗаменить(Текст, "АдресСервера", АдресСервера);
	Возврат Текст;
	
КонецФункции