
#Область ПрограммныйИнтерфейс

// Заполняет текст HTML переданного элемента, происходит запуск вложенного приложения 1С.
//
// Параметры:
//  ЭлементФормы	 - ПолеФормы - элемент вида ПолеHTMLДокумента, в котором будет
//					   запущено вложенное приложение
//  ПараметрОткрытия - Строка - параметр, который будет обработан после запуска.
//					   Если передана навигационная ссылка, она откроется.
//					   Если передана строка вида Форма=[ИмяФормы], то откроется
//					   форма с именем ИмяФормы, как в методе ОткрытьФорму().
//					   Если передана пустая строка, ничего не произойдет.
//					   Если передана любая другая строка, сработает оповещение
//  				 - ЛюбаяСсылка - ссылка на объект, который необходимо открыть.
//					   Поддерживаются все ссылки, которые могут иметь форму объекта.
//
Процедура ОткрытьВложенноеОкно(ЭлементФормы, ПараметрОткрытия = "") Экспорт
	
	Текст = ФНФ_ПовтИсп.ТекстHTML();
	Текст = СтрЗаменить(Текст, "ДопПараметры", ПреобразоватьСсылку(ПараметрОткрытия));
	
	Форма = НайтиФорму(ЭлементФормы);
	Форма[ЭлементФормы.Имя] = Текст;
		
КонецПроцедуры

// Открывает ссылку на объект во вложенном окне. Если приложение не запущено,
// происходит его открытие.
//
// Параметры:
//  ЭлементФормы	 - ПолеФормы - элемент вида ПолеHTMLДокумента, в котором
//					   будет открыта ссылка
//  Ссылка			 - Строка - навигационная ссылка
//  				 - ЛюбаяСсылка - ссылка на объект
//  ЗакрыватьФормы	 - Булево - Необязательный. Необходимо ли закрыть все активные
//					   формы вложенного приложения перед открытием новой. 
//
Процедура ОткрытьСсылкуВоВложенной(ЭлементФормы, Ссылка, ЗакрыватьФормы = Истина) Экспорт
	
	Форма = НайтиФорму(ЭлементФормы);
	Если Форма[ЭлементФормы.Имя] = "" Тогда
		
		ОткрытьВложенноеОкно(ЭлементФормы, Ссылка);
		
	Иначе
		
		Сообщение = ПреобразоватьСтруктуруВСообщение("URL", ПреобразоватьСсылку(Ссылка), ЗакрыватьФормы);
		ОтправитьСообщениеВложенной(ЭлементФормы, Сообщение);
		
	КонецЕсли;
	
КонецПроцедуры

// Открывает произвольную форму во вложенном окне. Если приложение не запущено,
// происходит его открытие.
//
// Параметры:
//  ЭлементФормы	 - ПолеФормы - элемент вида ПолеHTMLДокумента, в котором
//					   будет открыта форма
//  ИмяФормы		 - Строка - полное имя формы для открытия
//  Параметры		 - Произвольный - любые данные или структура данных, которая
//					   может быть сериальзована в JSON. Передается в параметры формы
//  ЗакрыватьФормы	 - Булево - Необязательный. Необходимо ли закрыть все активные
//					   формы вложенного приложения перед открытием новой. 
//
Процедура ОткрытьФормуВоВложенной(ЭлементФормы, ИмяФормы, Параметры = Неопределено, ЗакрыватьФормы = Истина) Экспорт
		
	Форма = НайтиФорму(ЭлементФормы);
	Если Форма[ЭлементФормы.Имя] = "" Тогда
		
		ОткрытьВложенноеОкно(ЭлементФормы, "Форма=" + ИмяФормы);
		
	Иначе
		
		Форма = Новый Структура;
		Форма.Вставить("Name", ИмяФормы);
		Форма.Вставить("Params", Параметры);
		
		Сообщение = ПреобразоватьСтруктуруВСообщение("Form", Форма, ЗакрыватьФормы);
		ОтправитьСообщениеВложенной(ЭлементФормы, Сообщение);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызов клиентского метода вложенного приложения. Указанная процедура должна быть
// экспортной, иметь два параметра. Второй параметр пока не используется.
//
// Параметры:
//  ЭлементФормы - ПолеФормы - элемент вида ПолеHTMLДокумента, в котором будет вызван метод
//  ИмяМодуля	 - Строка - имя клиентского модуля, в котором содержится процедура.
//				   Если указано "Форма", вызывается метод активной формы
//  ИмяПроцедуры - Строка - имя исполняемой процедуры
//  Параметры	 - Произвольный - любые данные или структура данных, которая может быть
//				   сериальзована в JSON. Передается в первый параметр процедуры.
//
Процедура ВыполнитьОповещениеВложенной(ЭлементФормы, ИмяМодуля, ИмяПроцедуры, Параметры) Экспорт
	
	Оповещение = Новый Структура;
	Оповещение.Вставить("Module", ИмяМодуля);
	Оповещение.Вставить("Method", ИмяПроцедуры);
	Оповещение.Вставить("Params", Параметры);
	
	Сообщение = ПреобразоватьСтруктуруВСообщение("Notify", Оповещение);
	ОтправитьСообщениеВложенной(ЭлементФормы, Сообщение);
	
КонецПроцедуры

// Передача произвольной строки вложенному приложению
//
// Параметры:
//  ЭлементФормы - ПолеФормы - элемент вида ПолеHTMLДокумента, в которое уйдет сообщение 
//  Сообщение	 - Строка - текст сообщения
//
Процедура ОтправитьСообщениеВложенной(ЭлементФормы, Сообщение) Экспорт
	
	ЭлементФормы.Документ.defaultView.messageToWebClient(Сообщение);
	
КонецПроцедуры

// Передача произвольной строки внешнему приложению
//
// Параметры:
//  Сообщение	 - Строка - текст сообщения 
//
Процедура ОтправитьСообщениеВнешней(Сообщение) Экспорт
	
	Если ОкноВнешнегоСайта.Доступно Тогда
        СообщениеСайту = Новый СообщениеВнешнемуСайту(Сообщение);
        ОкноВнешнегоСайта.ОтправитьСообщение(СообщениеСайту);
    КонецЕсли;
	
КонецПроцедуры

// Возвращает текст сообщения от вложенного приложения. Следует вызывать в событии
// ПриНажатии элемента ПолеHTMLДокумента, в котором запущено вложенное приложение.
//
// Параметры:
//  ЭлементФормы 	 - ПолеФормы - элемент вида ПолеHTMLДокумента, из которого пришло сообщение 
//  ДанныеСобытия	 - ФиксированнаяСтруктура - параметр события ПриНажатии,
//				 	   в котором содержится информация о сообщении
// 
// Возвращаемое значение:
//  Строка			 - текст сообщения от вложенного приложения. Если пусто,
//					   переданное событие было вызвано не сообщением.
//
Функция СообщениеОтВложенной(ЭлементФормы, ДанныеСобытия) Экспорт
	
	Если ЗначениеЗаполнено(ДанныеСобытия.Button.message) Тогда
		Сообщение = ДанныеСобытия.Button.message;
	Иначе
		Сообщение = "";
	КонецЕсли; 
	ДанныеСобытия.Button.message = "";
	Возврат Сообщение;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПередНачаломРаботыСистемы() Экспорт
	
	ЭтоВложенная = СтрНачинаетсяС(ПараметрЗапуска, "fonf");
	
	Если ЭтоВложенная Тогда
		#Если ВебКлиент Тогда
			КлиентскоеПриложение.УстановитьРежимОсновногоОкна(РежимОсновногоОкнаКлиентскогоПриложения.ВстроенноеРабочееМесто);
		#КонецЕсли
	КонецЕсли;
	
	ФНФ_Сервер.НастроитьИнтерфейс(ЭтоВложенная);
	ОбновитьИнтерфейс();
		
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы() Экспорт
	
	Если СтрНачинаетсяС(ПараметрЗапуска, "fonf") И ОкноВнешнегоСайта.Доступно Тогда
		
        ОбработчикСобытия = Новый ОписаниеОповещения("ПриПолученииСообщенияОтВнешней", ЭтотОбъект);
        ОкноВнешнегоСайта.ПодключитьОбработчикСообщений(ОбработчикСобытия);
		
		НачПоз = СтрНайти(ПараметрЗапуска, ":") + 1;
		ДопПарам = Сред(ПараметрЗапуска, НачПоз);
		ОбработатьСообщениеОтВнешней(ДопПарам);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриПолученииСообщенияОтВнешней(Сообщение, ДополнительныеПараметры) Экспорт
	
	ОбработатьСообщениеОтВнешней(Сообщение.Данные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьСообщениеОтВнешней(Сообщение)
	
	Если СтрНачинаетсяС(Сообщение, "{") И СтрЗаканчиваетсяНа(Сообщение, "}") Тогда
		
		СтруктСообщ = ФНФ_Сервер.ЗначениеJSON(Сообщение);
		
		Если СтруктСообщ.Свойство("CloseForms") И СтруктСообщ.CloseForms Тогда
			Для каждого Окно Из ПолучитьОкна() Цикл
				Если Окно.НачальнаяСтраница Тогда
					Продолжить;
				КонецЕсли;
				Форма = ФормаИзОкна(Окно);
				Если Форма <> Неопределено Тогда
					Форма.Закрыть();
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
		
		Если СтруктСообщ.Свойство("URL") Тогда
			
			ПерейтиПоНавигационнойСсылке(СтруктСообщ.URL);
			
		ИначеЕсли СтруктСообщ.Свойство("Form") Тогда
			
			ОткрытьФорму(СтруктСообщ.Form.Name, СтруктСообщ.Form.Params);
			
		ИначеЕсли СтруктСообщ.Свойство("Notify") Тогда
			
			Модуль = Неопределено;
			Если СтруктСообщ.Notify.Module = "Форма" Тогда
				Модуль = ФормаИзОкна(АктивноеОкно());
			Иначе
				Выполнить("Модуль = " + СтруктСообщ.Notify.Module);
			КонецЕсли; 
			
			Если Модуль = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			ОписОповещ = Новый ОписаниеОповещения(СтруктСообщ.Notify.Method, Модуль);
			ВыполнитьОбработкуОповещения(ОписОповещ, СтруктСообщ.Notify.Params);
			
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Сообщение, "e1cib") Тогда
		
		ПерейтиПоНавигационнойСсылке(Сообщение);
		
	ИначеЕсли СтрНачинаетсяС(Сообщение, "Форма=") Тогда
		
		ОткрытьФорму(СтрЗаменить(Сообщение, "Форма=", ""));
		
	ИначеЕсли ЗначениеЗаполнено(Сообщение) Тогда 
		
		Оповестить("СообщениеОтВнешней", Сообщение, "ФНФ");
		
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиФорму(ЭлементФормы)
	
	Форма = ЭлементФормы;
	Для Сч = 1 По 10 Цикл
		Форма = Форма.Родитель;
		Если ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения") Тогда
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	Если ТипЗнч(Форма) <> Тип("ФормаКлиентскогоПриложения") Тогда
		ВызватьИсключение "Не найдена форма-владелец для переданного элемента";
	КонецЕсли; 
	
	Возврат Форма;
	
КонецФункции

Функция ПреобразоватьСсылку(Ссылка)
	
	Если ТипЗнч(Ссылка) = Тип("Строка") Тогда
		Возврат Ссылка;
	Иначе
		Возврат ПолучитьНавигационнуюСсылку(Ссылка);
	КонецЕсли; 
	
КонецФункции

Функция ПреобразоватьСтруктуруВСообщение(ИмяПоля, ЗначениеПоля, ЗакрыватьФормы = Ложь)
	
	Структура = Новый Структура;
	Структура.Вставить(ИмяПоля, ЗначениеПоля);
	Структура.Вставить("CloseForms", ЗакрыватьФормы);
	Возврат ФНФ_Сервер.СтрокаJSON(Структура);
	
КонецФункции

Функция ФормаИзОкна(Окно)
	
	Если Окно <> Неопределено И Окно.Содержимое.Количество() > 0 Тогда
		Возврат Окно.Содержимое[0];
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
